{"code": "AWP 3", "title": "Analytical Writing", "units": "4", "dept": "AWP", "anchor": "awp3", "description": "AWP 3 provides writers the opportunity to develop their critical thinking and writing abilities. At the end of AWP 3, students will produce a portfolio of work that will determine their readiness to enter the college writing programs. Replaced AWP 1. Students may take AWP 3, AWP 1, and ELWR 1 for a combined total of three times to earn a passing grade of C or better to satisfy the UC Entry Level Writing Requirement."}
{"code": "AWP 4A", "title": "Analytical Writing and Academic English A", "units": "4", "dept": "AWP", "anchor": "awp4a", "description": "AWP 4A is the first of a two-quarter sequence designed to offer students who need extra English language support and/or more time to develop their critical thinking and writing abilities. Students who enroll in AWP 4A are required to enroll in AWP 4B in the subsequent quarter. Pass/Not Pass only. Replaced AWP 2A. Students may not receive credit for AWP 4A and AWP 2A or ELWR 2A. Students must earn a grade of Pass to move on to AWP 4B."}
{"code": "AWP 4B", "title": "Analytical Writing and Academic English B", "units": "4", "dept": "AWP", "anchor": "awp4b", "description": "AWP 4B is the second of a two-quarter sequence designed to offer students who need extra English language support and/or more time to develop their critical thinking and writing abilities. At the end of AWP 4B, students will produce a portfolio of work that will determine their readiness to enter the college writing programs. Replaced AWP 2B. Students may not receive credit for AWP 4B and AWP 2B or ELWR 2B. Students must earn a grade of C or better in AWP 4B to satisfy the UC Entry Level Writing Requirement. If a grade of C or better is not earned, students are placed in AWP 3. Prerequisites: AWP 4A.", "prereqs": "AWP 4A"}
{"code": "AWP 10", "title": "Language and Learning in the American Academy", "units": "4", "dept": "AWP", "anchor": "awp10", "description": "This analytical writing course provides students a critical lens through which they can explore debates about identity, language, and learning in higher education. In this course, students engage in critical thinking, reading, and writing practices necessary for success in the American academy. Students may not receive credit for AWP 10 and AWP 10R."}
{"code": "AWP 10R", "title": "Language and Learning in the American Academy", "units": "4", "dept": "AWP", "anchor": "awp10r", "description": "This remote analytical writing course provides students a critical lens through which they can explore debates about identity, language, and learning in higher education. In this course, students engage in critical thinking, reading, and writing practices necessary for success in the American academy. Students may not receive credit for AWP 10 and AWP 10R."}
{"code": "AWP 100", "title": "Writing a Researched Argument", "units": "4", "dept": "AWP", "anchor": "awp100", "description": "This course offers students intensive instruction in the critical and rhetorical practices necessary to craft strong, research-informed arguments. Students also make short multi-modal presentations to practice delivering what they have written. Course topics will vary. Prerequisites: upper-division or graduate standing."}
{"code": "AWP 101", "title": "Writing about Science", "units": "4", "dept": "AWP", "anchor": "awp101", "description": "Students write about scientific topics for non-scientific audiences, engaging with current debates in the sciences, analyzing the rhetorical strategies employed, and composing rhetorically strategic responses of their own. Students also make short multi-modal presentations to practice delivering what they have written. The intensive focus on writing and revising is especially useful for students who want to develop their writing. Prerequisites: upper-division or graduate standing."}
{"code": "AWP 102", "title": "Writing for the Professions", "units": "4", "dept": "AWP", "anchor": "awp102", "description": "Students use writing to explore and to create a professional identity. Assignments range from articulating the questions and problems that students hope to explore in their professional lives to understanding the current conversations in their chosen professions, and to fashioning resumes, cover letters, and presentations that declare what they hope to contribute professionally. The intensive focus on writing and revising is especially useful for students who want to develop their writing. Students may not receive credits for AWP 102 and AWP 102R. Prerequisites: upper-division or graduate standing."}
{"code": "AWP 102R", "title": "Writing for the Professions", "units": "4", "dept": "AWP", "anchor": "awp102r", "description": "In this remote course, students use writing to explore and to create a professional identity. Assignments range from articulating the questions and problems that students hope to explore in their professional lives to understanding the current conversations in their chosen professions, and to fashioning resumes, cover letters, and presentations that declare what they hope to contribute professionally. The intensive focus on writing and revising is especially useful for students who want to develop their writing. Students may not receive credits for AWP 102 and AWP 102R. Prerequisites: upper-division or graduate standing."}
{"code": "AWP 103", "title": "Writing about the Law", "units": "4", "dept": "AWP", "anchor": "awp103", "description": "Students write about legal topics for a general audience. Students will examine the rhetorical strategies employed by various stakeholders in controversial Supreme Court cases. They will then weigh in, composing their own strategic arguments. Students will also make short multi-modal presentations to practice delivering what they have written. The intensive focus on writing and revising is especially useful for students who want to develop their writing. This course fulfills the undergraduate Diversity, Equity, and Inclusion (DEI) requirement. Prerequisites: upper-division or graduate standing."}
