{"code": "CAT 1", "title": "Culture, Art, and Technology 1", "units": "4", "dept": "CAT", "anchor": "cat1", "description": "Lower-division composition course teaching critical reading and drafting by examining how culture, art, and technology have intersected in the past. Prerequisites: Sixth College students only; completion of UC Entry Level Writing Requirement."}
{"code": "CAT 2", "title": "Culture, Art, and Technology 2", "units": "6", "dept": "CAT", "anchor": "cat2", "description": "Lower-division writing-intensive course foregrounding argumentation, revision, and writing as process by examining case studies of culture, art, and technology interacting in the present moment. Prerequisites: Sixth College students only; CAT 1.", "prereqs": "CAT 1"}
{"code": "CAT 3", "title": "Culture, Art, and Technology 3", "units": "6", "dept": "CAT", "anchor": "cat3", "description": "Lower-division writing- and research-intensive course focusing on collaboration, research, and art-making by speculating on how the relationships between culture, art, and technology will be transformed in the future. Prerequisites: Sixth College students only; CAT 2.", "prereqs": "CAT 2"}
{"code": "CAT 24", "title": "Introduction to Special Projects/Topics", "units": "2 or 4", "dept": "CAT", "anchor": "cat24", "description": "Lower-division students are introduced to projects/topics exploring the interplay of culture, art, and technology. Topics and projects will vary. May be taken for credit two times. Prerequisites: department authorization required."}
{"code": "CAT 75", "title": "Experience Art!—Sixth College Seminar Series", "units": "1", "dept": "CAT", "anchor": "cat87", "description": "Seminars are hands-on arts experiences (performances, exhibits, site visits, etc.). Students and faculty attend events together and have discussions before or after, often with guest speakers such as the artists, curators, and/or faculty/graduate students from UC San Diego arts departments. Successful completion of this seminar series satisfies one unit of art making for the Sixth College general education requirements. May be taken for credit two times. Prerequisites: Sixth College students only."}
{"code": "CAT 87", "title": "First-year Student Seminar", "units": "1", "dept": "CAT", "anchor": "cat87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students with preference given to entering first-year students. May be taken for credit four times. Prerequisites: none."}
{"code": "CAT 90", "title": "Introduction to Experiential Learning Seminar", "units": "1", "dept": "CAT", "anchor": "cat90", "description": "A lower-division seminar to introduce new Sixth College students to experiential learning in a small-group setting. It explores relevant practices in a variety of disciplines and avenues for immersive learning in areas such as community engagement, fieldwork, research, internship, and study abroad. Students will learn to access experiential learning resources and to identify and approach prospective mentors. Recommended preparation for Sixth College’s practicum requirement. May be taken for credit three times. Prerequisites: Sixth College students only; department authorization required."}
{"code": "CAT 98", "title": "Culture, Art, and Technology Lower-Division Group Study", "units": "2 or 4", "dept": "CAT", "anchor": "cat98", "description": "Course designated for lower-division Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive then individual special studies. May be taken for credit three times. Prerequisites: lower-division standing; cumulative GPA of 3.0."}
{"code": "CAT 124", "title": "Sixth College Practicum", "units": "4", "dept": "CAT", "anchor": "cat124", "description": "Students initiate, plan, and carry out community-based and/or research-based projects that connect classroom-based experiences and knowledge to the outlying community, and that explicitly explore the interplay of culture, art, and technology. May be taken for credit two times. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 124GS", "title": "Sixth College Practicum Global Seminar", "units": "4", "dept": "CAT", "anchor": "cat124gs", "description": "This course will have students initiate, plan, and carry out research-based and/or community-based projects. These projects will connect classroom-based experiences and knowledge to the outlying community, and explicitly explore the interplay of culture, art, and technology. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 124RS", "title": "Sixth College Practicum Online Global Seminar", "units": "4", "dept": "CAT", "anchor": "cat124rs", "description": "Students initiate, plan, and carry out research-based and/or community-based projects that connect classroom-based experiences and knowledge to the outlying community, and that explicitly explore the interplay of culture, art, and technology. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 125", "title": "Public Rhetoric and Practical Communication", "units": "4", "dept": "CAT", "anchor": "cat125", "description": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. Students will not receive credit for both CAT 125 and CAT 125R. Prerequisites: Sixth College students only; upper-division standing."}
{"code": "CAT 125GS", "title": "Public Rhetoric and Practical Communication Global Seminar", "units": "4", "dept": "CAT", "anchor": "cat125gs", "description": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing requirement is preferred but not required. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 125R", "title": "Public Rhetoric and Practical Communication Online", "units": "4", "dept": "CAT", "anchor": "cat125r", "description": "Online upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. Students will not receive credit for both CAT 125R and CAT 125. This course is a distance education course. Prerequisites: Sixth College students only; upper-division standing."}
{"code": "CAT 125RS", "title": "Public Rhetoric and Practical Communication Online Global Seminar", "units": "4", "dept": "CAT", "anchor": "cat125rs", "description": "Online upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing requirement is preferred but not required. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 192", "title": "Senior Seminar in Culture, Art, and Technology", "units": "1", "dept": "CAT", "anchor": "cat192", "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in culture, art, and technology (at the upper-division level). Topics will vary from quarter to quarter. Enrollment is limited to twenty students, with preference given to seniors. May be taken for credit four times. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 195", "title": "Apprentice Teaching", "units": "4", "dept": "CAT", "anchor": "cat195", "description": "Undergraduate instructional assistance. Responsibilities in areas of learning and instruction. May collect course material and assist with course projects, digital workshops, and collection, organization, and analysis of formative assessment data. Prerequisites: upper-division standing; 3.0 cumulative GPA; department authorization required."}
{"code": "CAT 197", "title": "Culture, Art, and Technology Field Studies", "units": "4", "dept": "CAT", "anchor": "cat197", "description": "Supervised community-based or industry-based fieldwork. Designated for Sixth College students to have the opportunity to work on a community-based or industry-based project supervised by a faculty member and community or industry mentor in which the subject or content of the project cannot be represented by a specific academic department. Students will submit written evaluations each week of their ongoing field study. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
{"code": "CAT 198", "title": "Culture, Art, and Technology Directed Group Studies", "units": "4", "dept": "CAT", "anchor": "cat198", "description": "Directed group studies or, in group, field studies of a creative project. Designated for Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive than individual special studies. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
{"code": "CAT 199", "title": "Culture, Art, and Technology Independent Studies", "units": "4", "dept": "CAT", "anchor": "cat199", "description": "Individual independent research or creative project. Designated for Sixth College students to have the opportunity to work on a project supervised by a faculty member in a specific department, where the subject or content of the project cannot be represented by the academic department of the faculty member. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
