{"code": "HUM 1", "title": "The Foundations of Western Civilization: Israel and Greece", "units": "6", "dept": "HUM", "anchor": "hum1", "description": "Texts from the Hebrew Bible and from Greek epic, history, drama, and philosophy in their cultural context. Revelle students must take course for letter grade. Prerequisites: satisfaction of the UC Entry Level Writing requirement."}
{"code": "HUM 2", "title": "Rome, Christianity, and the Middle Ages", "units": "6", "dept": "HUM", "anchor": "hum2", "description": "The Roman Empire, the Christian transformation of the classical world in late antiquity, and the rise of a European culture during the Middle Ages. Representative texts from Latin authors, early Christian literature, the Germanic tradition, and the high Middle Ages. Revelle students must take course for letter grade. Prerequisites: satisfaction of the UC Entry Level Writing requirement."}
{"code": "HUM 3", "title": "Renaissance, Reformation, and Early Modern Europe", "units": "4", "dept": "HUM", "anchor": "hum3", "description": "The revival of classical culture and values and the reaction against medieval ideas concerning the place of human beings in the world. The Protestant Reformation and its intellectual and political consequences. The philosophical background to the scientific revolution. Revelle students must take the course for a letter grade. Students may not receive credit for HUM 3 and HUM 3GS. Prerequisites: completion of HUM 1 or HUM 2.", "prereqs": {"type": "one", "courses": ["HUM 1", "HUM 2"]}}
{"code": "HUM 3GS", "title": "Renaissance, Reformation, and Early Modern Europe", "units": "4", "dept": "HUM", "anchor": "hum3gs", "description": "The revival of classical culture and values and the reaction against medieval ideas concerning the place of human beings in the world. The Protestant Reformation and its intellectual and political consequences. The philosophical background to the scientific revolution. Revelle students must take the course for a letter grade. Students may not receive credit for HUM 3 and 3GS. Prerequisites: acceptance into Global Seminar Program."}
{"code": "HUM 4", "title": "Enlightenment, Romanticism, Revolution", "units": "4", "dept": "HUM", "anchor": "hum4", "description": "The Enlightenment’s revisions of traditional thought; the rise of classical liberalism; the era of the first modern political revolutions; Romantic ideas of nature and human life. Revelle students must take course for letter grade. Students may receive credit for one of the following: HUM 4, HUM 4R, or HUM 4GS. Prerequisites: satisfaction of the UC Entry Level Writing requirement."}
{"code": "HUM 4R", "title": "Enlightenment, Romanticism, Revolution", "units": "4", "dept": "HUM", "anchor": "hum4r", "description": "The Enlightenment’s revisions of traditional thought; the rise of classical liberalism; the era of the first modern political revolutions; Romantic ideas of nature and human life. This course is a distance education course. Revelle students must take course for letter grade. Students may receive credit for one of the following: HUM 4, HUM 4R, or HUM 4GS."}
{"code": "HUM 4GS", "title": "Enlightenment, Romanticism, Revolution", "units": "4", "dept": "HUM", "anchor": "hum4gs", "description": "This five-week global seminar in Edinburgh will examine the core philosophical, scientific, political, and cultural ideas that formed the basis of the Enlightenment, the romantic movement, and revolutions in Europe and America from the late seventeenth century through the first half of the nineteenth century. Revelle students must take course for letter grade. Students may receive credit for one of the following: HUM 4, HUM 4R, or HUM 4GS. Prerequisites: acceptance into Global Seminar Program."}
{"code": "HUM 5", "title": "Modern Culture (1848–present)", "units": "4", "dept": "HUM", "anchor": "hum5", "description": "Challenges to liberalism posed by such movements as socialism, imperialism, and nationalism; the growth of new forms of self-expression and new conceptions of individual psychology. Revelle students must take course for letter grade. Prerequisites: satisfaction of the UC Entry Level Writing requirement."}
{"code": "HUM 100", "title": "Advanced Topics in the Humanities", "units": "4", "dept": "HUM", "anchor": "hum100", "description": "An upper-division course designed to strengthen students’ critical reading and analytical writing skills through engagement with core texts in the humanities on a selected theme."}
{"code": "HUM 119", "title": "Special Topics in Humanities", "units": "4", "dept": "HUM", "anchor": "hum119", "description": "An in-depth study of topics in the humanities. Subject matter varies, focusing on one author, intellectual topic, or specific historical tradition. May be repeated up to three times for credit when topics vary."}
{"code": "HUM 195", "title": "Methods of Teaching Humanities", "units": "4", "dept": "HUM", "anchor": "hum195", "description": "An introduction to teaching humanities. Students are required to attend weekly discussions on methods of teaching humanities and will teach discussion sections of one of the humanities courses. Attendance at lecture of the course in which the student is participating is required. (P/NP grades only.) Prerequisites: consent of instructor."}
{"code": "HUM 199", "title": "Special Studies", "units": "2–4", "dept": "HUM", "anchor": "hum199", "description": "Individually guided readings or projects in area of humanities not normally covered in standard curriculum. Prerequisites: upper-division standing or consent of instructor."}
{"code": "HUM 200", "title": "Seminar in the Humanities", "units": "4", "dept": "HUM", "anchor": "hum200", "description": "Selected topics in the history, literature, and thought of Mediterranean antiquity and its successor-cultures. Emphasis on identifying both common themes and cultural distinctiveness. Discussion of pedagogical approaches to this material. Required of all graduate instructional assistants in the humanities sequence. Prerequisites: graduate standing."}
