{"code": "MMW 11", "title": "Prehistory and Ancient Foundations", "units": "4", "dept": "MMW", "anchor": "mmw11", "description": "This course explores human origins, the development of early forms of social and political organization, the strategies that early societies used to negotiate their physical and social environments, and the appearance of influential cultural traditions across the ancient world (to circa 100 BCE). Topics include the emergence of agriculture, the relationship between nomad and settled, the birth of the city and the expanding human “footprint,” the development of writing, foundational religious and cosmological ideas and narratives, influential models of visual and material culture, and changing forms of social stratification and inequality. Students may not receive credit for both MMW 11 and MMW 11R. Must be taken for a letter grade to meet the requirement."}
{"code": "MMW 12", "title": "Transforming Traditions and Emerging World Communities, circa 100 BCE–1200 CE", "units": "6", "dept": "MMW", "anchor": "mmw12", "description": "This course provides a global perspective on the past from circa 100 BCE to circa 1200 CE, examining the emergence of interregional networks and empires and their relationship with the advent and expansion of diverse religious movements, including Christianity, Islam, and Buddhism, as well as cross-cultural contacts and exchanges. The course also explores forms of identity (ethnic, religious, and other); models of inclusion and exclusion; systems of power, hierarchy, and slavery; and the human-environmental relationship. MMW 12 is the first of two writing-intensive courses in the MMW sequence. Prerequisites: satisfaction of the Entry Level Writing Requirement. Must be taken for a letter grade to meet the requirement."}
{"code": "MMW 13", "title": "A Globalizing World: Exchanges, Entanglements, and Exploitation, Thirteenth–Eighteenth Century", "units": "6", "dept": "MMW", "anchor": "mmw13", "description": "This course presents a global perspective on the connections, exchanges, and transformations that linked Afro-Eurasia and the Americas during the period from 1200 to 1750 CE. The course examines the nature and consequences of this increasingly connected world. It focuses on spaces of cross-cultural contact and exchange, including the transfer of technologies, ideas, commodities, and customs and their environmental impact; encounters in the form of travel, trade, migration, and invasion; and exploitation through empire, colonization, and slavery, and their manifestation in state violence, intolerance, discrimination, and racism. MMW 13 is the second of two writing-intensive courses in the MMW sequence. Prerequisites: completion of MMW 12. Open to Eleanor Roosevelt College students only. Must be taken for a letter grade to meet the requirement.", "prereqs": "MMW 12"}
{"code": "MMW 14", "title": "Revolution, Industry, and Empire", "units": "4", "dept": "MMW", "anchor": "mmw14", "description": "This course examines the great changes in European society occurring from the late seventeenth century to the time of the Russian Revolution and considers the impact of those changes on the non-Western world. Topics include absolutist states and the Enlightenment, the French and American Revolutions, industrialization, the rise of nationalism and the nation-state, mass politics, Western imperialism, and the colonial experience. Developments in non-Western countries during this period will be examined from their own internal perspectives. Prerequisites: completion of MMW 12 or MMW 2; and completion of MMW 13 or MMW 3; open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 14 and MMW 5. Must be taken for a letter grade to meet the requirement.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MMW 12", "MMW 2"]}, {"type": "one", "courses": ["MMW 13", "MMW 3"]}]}}
{"code": "MMW 15", "title": "The Contemporary Era: Conflict and Aspirations in a Globalized World, Twentieth–Twenty-First Century", "units": "4", "dept": "MMW", "anchor": "mmw15", "description": "This course explores the cultural, economic, political, and social forces that shaped the twentieth and twenty-first century and contestations over them. It examines the causes and impact of the global and local conflicts and inequalities that have defined the contemporary era. The course addresses efforts to defend and expand freedom, improve quality of life, and increase transnational cooperation and communication that challenge those hierarchies that perpetuate inequality. The course reflects on what this recent history may mean for our collective future. NOTE: In place of MMW 15, you may take MMW 15GS (Global Seminar). Prerequisites: completion of MMW 12 and MMW 13; open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 15 and MMW 15GS. Must be taken for a letter grade to meet the requirement.", "prereqs": {"type": "all", "courses": ["MMW 12", "MMW 13"]}}
{"code": "MMW 121", "title": "Exploring the Premodern World", "units": "4", "dept": "MMW", "anchor": "mmw121", "description": "MMW 121, the first of two required courses for ERC transfer students, addresses themes and topics from the premodern world (from antiquity to the eighteenth century) and strengthens students’ analytical, research, and writing skills. Students may not receive credit for MMW 121 and 121R. Students who previously took MMW 21 and received a grade of D or F should contact Eleanor Roosevelt College academic advising for guidance. Prerequisites: open to Eleanor Roosevelt College transfer students only. Must be taken for a letter grade to meet the requirement."}
{"code": "MMW 122", "title": "Exploring the Modern World", "units": "4", "dept": "MMW", "anchor": "mmw122", "description": "MMW 122, the second of two required courses for ERC transfer students, addresses specific themes and topics from the modern world (from the eighteenth century to the present) and strengthens transfer students’ analytical, research, and writing skills. Students may not receive credit for MMW 22 and 122. Students who previously took MMW 22 and received a grade of D or F should contact Eleanor Roosevelt College academic advising for guidance. Prerequisites: open to Eleanor Roosevelt College transfer students only. Must be taken for a letter grade to meet the requirement."}
