{"code": "SYN 1", "title": "Communicating for a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn1", "description": "Synthesis 1 asks students to critically examine through an interdisciplinary and antiracist lens how we communicate about the climate crisis in order to address the question of how we get people to respond and take action. Through a variety of assignments and activities, students develop an awareness of both the message of a text and how the author crafted that message. They learn how to assess the purpose, audience, and context of different rhetorical situations. Prerequisites: Seventh College students only, completion of UC Entry Level Writing requirement, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 1R."}
{"code": "SYN 1R", "title": "Communicating for a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn1r", "description": "Synthesis 1R asks students to critically examine through an interdisciplinary and antiracist lens how we communicate about the climate crisis in order to address the question of how we get people to respond and take action. Through a variety of assignments and activities, students develop an awareness of both the message of a text and how the author crafted that message. They learn how to assess the purpose, audience, and context of different rhetorical situations. Prerequisites: Seventh College students only, completion of UC Entry Level Writing requirement, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 1."}
{"code": "SYN 2", "title": "Inquiring about a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn2", "description": "Synthesis 2 builds upon the skills developed in Synthesis 1. In the first half of the quarter, students learn the links between climate change and racial justice. Using an antiracist framework, students work in a small group to research an aspect of the climate crisis. In the second half of the quarter, students are introduced to project design and learn how to draft a proposal. Students learn how to determine the scope of a project based on such criteria as time, money, and potential impact. Prerequisites: Seventh College students only, SYN 1/SYN 1R, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 2R.", "prereqs": {"type": "one", "courses": ["SYN 1", "SYN 1R"]}}
{"code": "SYN 2R", "title": "Inquiring about a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn2r", "description": "Synthesis 2 builds upon the skills developed in Synthesis 1. In the first half of the quarter, students learn the links between climate change and racial justice. Using an antiracist framework, students work in a small group to research an aspect of the climate crisis. In the second half of the quarter, students are introduced to project design and learn how to draft a proposal. Students learn how to determine the scope of a project based on such criteria as time, money, and potential impact. Prerequisites: Seventh College students only, SYN 1/SYN 1R, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 2.", "prereqs": {"type": "one", "courses": ["SYN 1", "SYN 1R"]}}
{"code": "SYN 100", "title": "Engaging with a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn100", "description": "SYN 100 is a project-based course that builds upon foundational skills by taking a collaborative, interdisciplinary approach to complex global problems. Each section focuses on a different theme, challenge, or question related to the climate crisis. Despite the different class topics, all students will learn by designing and executing a team project that addresses their section’s theme. Prerequisites: restricted to Seventh College students only, upper-division standing, completion of SYN 1/1R and 2/2R, must be taken for a letter grade to count toward Seventh College general-education requirements.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SYN 1", "SYN 1R"]}, {"type": "one", "courses": ["SYN 2", "SYN 2R"]}]}}
{"code": "SYN 150", "title": "Defining the Scope of a Changing Planet", "units": "4", "dept": "SYN", "anchor": "syn150", "description": "SYN 150 is recommended for Seventh College transfer students in preparation for SYN 100. Students critically examine, through an interdisciplinary and antiracist lens, key issues impacting our changing planet. Prerequisites: restricted to Seventh College transfer students only, must be taken for a letter grade to count toward Seventh College high-impact requirement, cannot be taken concurrently or after SYN 100.", "coreqs": "SYN 100"}
{"code": "SYN 199", "title": "Independent Study", "units": "2 or 4", "dept": "SYN", "anchor": "syn199", "description": "Independent study designated for Seventh College students who wish to carry out a project they begin in previous synthesis program courses. Prerequisites: completion of SYN 100, restricted to upper-division Seventh College students only, must be taken P/NP only, can be taken up to two times for credit, must complete at least ninety units with a 2.5 GPA in upper-division undergraduate courses at UC San Diego, department approval is required, enrollment satisfies the Seventh College high-impact requirement.", "prereqs": "SYN 100"}
{"code": "SYN 500", "title": "Apprentice Teaching in Synthesis Program", "units": "2 or 4", "dept": "SYN", "anchor": "syn500", "description": "Consideration and development of key changing planet topics and pedagogical methods appropriate to undergraduate teaching in the interdisciplinary Synthesis Program writing courses, under the supervision of the program director. May be taken for credit up to eighteen times. Prerequisites: department approval required."}
